package lesson_4
/*Программа тренировок разбивает упражнения на две группы: упражнения для мышц рук/пресса и ног/спины.
Она рекомендует делать упражнения на каждую группу мышц через день. Пользователь начал занятия с рук и пресса.
Напиши программу, которая будет сообщать, какие упражнения нужно выполнить сегодня.

Предположим, что сегодня 5 день тренировок. В первый день выполнялись упражнения для рук и пресса.
Выведи сообщение в виде нескольких красивых ровных строк.

Вывод должен быть таким:
Упражнения для рук:       true
Упражнения для ног:       false
Упражнения для спины:  false
Упражнения для пресса: true

- программа должна быть легко поддерживаема (чтобы можно было быстро добавить или убрать
какие-то типы тренировок);
- все сообщение должно печататься в одном println();
- при изменении значения переменной дня тренировки на 1 день вперед, вывод должен меняться.*/

fun main() {
    var hands = true
    var legs = false
    var back = false
    var press = true

    var counter = 5
    counter = counter % 2
    when (counter) {
        0 -> {
            hands = true; legs = false; back = false; press = true
        }
        1 -> {
            hands = false; legs = true; back = true; press = false
        }
    }
    println(
        """
        |Упражнения для рук: $hands
        |Упражнения для ног: $legs
        |Упражнения для сины: $back
        |Упражнения для пресса: $press
    """.trimMargin()
    )
}
